Tekla Open API Reference for Tekla Structures 2025
ControlPoint Constructor (Point)
 Initializes a new instance of the ControlPoint class with an existing point.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public ControlPoint(
	Point existPoint
)
Public Sub New (
	existPoint As Point
)
Parameters
existPoint
Type: Tekla.Structures.Geometry3d.Point
An existing point
See Also
Reference
ControlPoint Class
ControlPoint Overload
Tekla.Structures.Model Namespace